In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Structures

### Series

In [6]:
obj = pd.Series([4, 7, -5, 3])

In [7]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2 = pd.Series([4,7,-5,3], index=["d","b","a","c"])

In [11]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2["a"]

-5

In [14]:
obj2["b"]

7

In [15]:
obj2[["c","a","d"]]

c    3
a   -5
d    4
dtype: int64

In [16]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [17]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [18]:
import numpy as np

np.exp(obj2)

*checking if index is in series*

In [19]:
"b" in obj2

True

In [20]:
"e" in obj2

False

*turning dict to series*

In [21]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [39]:
obj3 = pd.Series(sdata)

In [40]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [43]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [44]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [45]:
obj4 = pd.Series(sdata, index=states)

In [46]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

*checking if an index has missing data*

In [47]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [48]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

*adding series together*

In [49]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [50]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [51]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [52]:
obj4.name = "Populations"

In [58]:
obj4.index.name = "States:"

In [59]:
obj4

States:
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Populations, dtype: float64

*altering a series idex*

In [60]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

*creating a data frame*

In [61]:
frame = pd.DataFrame(data)

In [62]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

*shows first 5 then shows last 5*

In [63]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [64]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

*specifying order of columns*

In [69]:
pd.DataFrame(data, columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

*passing in a column that isnt in the dict will appear missing*

In [73]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [74]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [75]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [78]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [79]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [80]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

*getting info from certain row?*

In [84]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

*altering column values*

In [86]:
frame2["debt"] = 16.6

In [87]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.6
1  2001    Ohio  1.7  16.6
2  2002    Ohio  3.6  16.6
3  2001  Nevada  2.4  16.6
4  2002  Nevada  2.9  16.6
5  2003  Nevada  3.2  16.6

In [88]:
frame2["debt"] = np.arange(6.)

In [89]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

*When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any index values not present:*

In [90]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [91]:
frame2["debt"] = val

In [92]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

*assigning a column that doesnt exist will create a new column*

In [95]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [96]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

*deleting columns*

In [97]:
del frame2["eastern"]

In [99]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

*pandas will interpret nested dicts as follows: outer dict keys as columns, inner keys as rows

In [100]:
In [72]: populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
   ....:                "Nevada": {2001: 2.4, 2002: 2.9}}

In [101]:
frame3 = pd.DataFrame(populations)

In [102]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

*swapping rows and columns*

In [103]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

*The keys in the inner dictionaries are combined to form the index in the result. This isn’t true if an explicit index is specified:*

In [105]:
pd.DataFrame(populations, index = [2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [107]:
pdata = {"Ohio": frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}

In [108]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

*If a DataFrame’s index and columns have their name attributes set, these will also be displayed:*

In [109]:
frame3.index.name = "year"

In [110]:
frame3.columns.name = "state"

In [111]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

*dataframes do not have a name attribute*

In [113]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

*If the DataFrame’s columns are different data types, the data type of the returned array will be chosen to accommodate all of the columns:*

In [114]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

*pandas’s Index objects are responsible for holding the axis labels (including a DataFrame's column names) and other metadata (like the axis name or names). Any array or other sequence of labels you use when constructing a Series or DataFrame is internally converted to an Index:*

In [115]:
obj = pd.Series(np.arange(3), index=["a","b","c"])

In [116]:
index = obj.index

In [117]:
index

Index(['a', 'b', 'c'], dtype='object')

In [123]:
index[1:]

Index(['b', 'c'], dtype='object')

*index objects are immutable and thus can not be modified by the user*

*Immutability makes it safer to share Index objects among data structures:*

In [124]:
labels = pd.Index(np.arange(3))

In [125]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [126]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [127]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [128]:
obj2.index is labels

True

*in addition to being arrray-like, an index also behaves like a fixed-size set:*

In [129]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [130]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [132]:
"Ohio" in frame3.columns

True

In [133]:
2003 in frame3.index

False

*Unlike Python sets, a pandas Index can contain duplicate labels:*

In [134]:
pd.Index(["foo","foo","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

*an important method on pandas objects is reindex, which eans to create a new object with values rearranged to align with the new index. consider this example*

In [135]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d","b","a","c"])

In [136]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

*calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index calues were not already present:*

In [137]:
obj2 = obj.reindex(["a","b","c","d","e"])

In [138]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

*for ordered data like time series, you may want to do some interpolation or filling of values when reindexing. the method option allows us to do this, using a methid such as ffill, which forward-fills the values:*

In [142]:
obj3 = pd.Series(["blue","purple","yellow"], index=[0,2,4])

In [143]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [144]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

*with Dataframe, reindex can alter the (row)index, columns, or both. When passed only a sequence, it reindexes the rows in the result:*

In [148]:
In [105]: frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"])

In [149]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [150]:
frame2 = frame.reindex(index=["a","b","c","d"])

In [151]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

*the columns can be reindexed with the columns keyword*

In [154]:
states = ["Texas","Utah","California"]

In [155]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

*Because "Ohio" was not in states, the data for that column is dropped from the result*

*Another way to reindex a particular axis is to pass the new axis labels as a positional argument and then specify the axis with the axis keyword*

In [156]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

*you can reindex by using the loc operator, and many users prefer to always do it this way. This works only if all of the new index labels already exist in the DataFrame (Whereas reindex will insert missing data for new labels)*

In [159]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

*Dropping one or more entries from an axis is simple if you already have an index array or list without those entries, since you can use the reindex method or .loc-based indexing. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis:*

In [160]:
obj = pd.Series(np.arange(5.), index=["a","b","c","d","e"])

In [161]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [162]:
new_obj = obj.drop("c")

In [163]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [164]:
obj.drop(["d","c"])

a    0.0
b    1.0
e    4.0
dtype: float64

*With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example DataFrame:*

In [165]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=["Ohio", "Colorado", "Utah", "New York"],columns=["one", "two", "three", "four"])

In [166]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

*Calling Drop with a sequence will drop values from the row labels (axis 0)*

In [167]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

*To drop labels from the columns, instead use the columns keyword*

In [172]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

*You can also drop values from the columns by passing axis=1(which is like NumPy)or axis="columns"*

In [173]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

*Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers. Here are some examples of this:*

In [174]:
obj = pd.Series(np.arange(4.), index=["a","b","c","d"])

In [175]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [176]:
obj["b"]

1.0

In [177]:
obj[1]

1.0

In [178]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [179]:
obj[["b","a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [180]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [181]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

*While you can select data by label this way, the preferred way to select index values is with the special loc operator:*

In [182]:
obj.loc[["b","a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

*The reason to prefer loc is because of the different treatment of integers when indexing with []. Regular []-based indexing will treat integers as labels if the index contains integers, so the behavior differs depending on the data type of the index. For example:*

In [183]:
obj1 = pd.Series([1,2,3], index=[2,0,1])

In [184]:
obj2 = pd.Series([1,2,3], index=["a","b","c"])

In [185]:
obj1

2    1
0    2
1    3
dtype: int64

In [186]:
obj2

a    1
b    2
c    3
dtype: int64

In [187]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [188]:
obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

*loc does not work when index does not contain integers*

*Since loc operator indexes exclusively with labels, there is also an iloc operator that indexes exclusively with integers to work consistently whether or not the index contains integers:*

In [190]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [191]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [192]:
obj.loc["b":"c"]

b    1.0
c    2.0
dtype: float64

*Assigning values using these methods modifies the corresponding section of the Series:*

In [193]:
obj.loc["b":"c"] = 5

In [194]:
obj2

a    1
b    2
c    3
dtype: int64

*Indexing into a DataFrame retrieves one or more columns either with a single value or sequence:*

In [196]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=["Ohio", "Colorado", "Utah", "New York"],columns=["one", "two", "three", "four"])

In [197]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [198]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [ ]:
data[["three","one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

*Indexing like this has a few special cases. The first is slicing or selecting data with a Boolean array:*

In [200]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [201]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

*The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects columns.

Another use case is indexing with a Boolean DataFrame, such as one produced by a scalar comparison. Consider a DataFrame with all Boolean values produced by comparing with a scalar value:*

In [202]:
data <5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [203]:
data[data<5] = 0

In [204]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

*Like Series, DataFrame has special attributes loc and iloc for label-based and integer-based indexing, respectively. Since DataFrame is two-dimensional, you can select a subset of the rows and columns with NumPy-like notation using either axis labels (loc) or integers (iloc).*

*As a first example, let's select a single row by label:*

In [205]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [206]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

*The result of selecting a single row is a Series with an index that contains the DataFrame's column labels. To select multiple roles, creating a new DataFrame, pass a sequence of labels:*

In [207]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

*You can combine both row and column section in loc by separating the selections with a comma:*

In [208]:
data.loc["Colorado",["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

*peforming similar selections with integers using iloc*

In [210]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [211]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [212]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

*Both indexing functions work with slices in addition to single labels or lists of labels:*

In [213]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [214]:
data.iloc[:, :3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

*Boolean arrays can be used with loc but not iloc:*

In [215]:
data.loc[data.three >=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [216]:
ser = pd.Series(np.arange(3.))

In [217]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

*In this case, pandas could “fall back” on integer indexing, but it is difficult to do this in general without introducing subtle bugs into the user code. Here we have an index containing 0, 1, and 2, but pandas does not want to guess what the user wants (label-based indexing or position-based):*

In [218]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [219]:
ser2 = pd.Series(np.arange(3.), index=["a","b","c"])

In [220]:
ser2[-1]

2.0

*If you have an axis index containing integers, data selection will always be label oriented. As I said above, if you use loc (for labels) or iloc (for integers) you will get exactly what you want:*

In [221]:
ser.iloc[-1]

2.0

In [222]:
ser[:2]

0    0.0
1    1.0
dtype: float64

*In the previous section we looked at how you can do flexible selections on a DataFrame using loc and iloc. These indexing attributes can also be used to modify DataFrame objects in place, but doing so requires some care.

For example, in the example DataFrame above, we can assign to a column or row by label or integer position:*

In [223]:
data.loc[:, "one"] = 1

In [224]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [232]:
data.iloc[2] = 5

In [233]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [234]:
data.loc[data["four"] > 5] = 3

In [235]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [236]:
data.loc[data.three == 5, "three"] = 6

In [237]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

*pandas can make it much simpler to work with objects that have different indexes. For example, when you add objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs. Let’s look at an example:*

In [238]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [245]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c","e","f","g"])

In [246]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [247]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

*adding these yeilds*

In [248]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

*The internal data alignment introduces missing values in the label locations that don’t overlap. Missing values will then propagate in further arithmetic computations.*

*In the case of DataFrame, alignment is performed on both rows and columns:*

In [249]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),index=["Ohio", "Texas", "Colorado"])

In [250]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])

In [251]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [252]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

*Adding these returns a DataFrame with index and columns that are the unions of the ones in each DataFrame:*

In [253]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

*If you add DataFrame objects with no column or row labels in common, the result will contain all nulls:*

In [254]:
df1 = pd.DataFrame({"A": [1,2]})

In [255]:
df2 = pd.DataFrame({"B": [3,4]})

In [256]:
df1

   A
0  1
1  2

In [257]:
df2

   B
0  3
1  4

In [258]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

*In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other. Here is an example where we set a particular value to NA (null) by assigning np.nan to it:*

In [259]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list("abcd"))

In [260]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),columns=list("abcde"))

In [261]:
df2.loc[1, "b"] = np.nan

In [262]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [263]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

*Adding these results in missing values in the locations that don’t overlap:*

In [264]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

*Using the add method on df1, I pass df2 and an argument to fill_value, which substitutes the passed value for any missing values in the operation:*

In [265]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [266]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [267]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [268]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

*As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series is also defined. First, as a motivating example, consider the difference between a two-dimensional array and one of its rows:*

In [269]:
arr = np.arange(12.).reshape((3,4))

In [270]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [271]:
arr[0]

array([0., 1., 2., 3.])

In [272]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

*When we subtract arr[0] from arr, the subtraction is performed once for each row. This is referred to as broadcasting and is explained in more detail as it relates to general NumPy arrays in Appendix A: Advanced NumPy. Operations between a DataFrame and a Series are similar:*

In [273]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])

In [274]:
series = frame.iloc[0]

In [275]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [276]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

*By default, arithmetic between DataFrame and Series matches the index of the Series on the columns of the DataFrame, broadcasting down the rows:*

In [278]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

*If an index value is not found in either the DataFrame’s columns or the Series’s index, the objects will be reindexed to form the union:*

In [279]:
series2 = pd.Series(np.arange(3), index=["b","e","f"])

In [280]:
series2

b    0
e    1
f    2
dtype: int64

In [281]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [282]:
series3 = frame["d"]

In [283]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [284]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [285]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

*The axis that you pass is the axis to match on. In this case we mean to match on the DataFrame’s row index (axis="index") and broadcast across the columns.*

*NumPy ufuncs (element-wise array methods) also work with pandas objects:*

In [286]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])

In [287]:
frame

               b         d         e
Utah    1.447336  1.348350  0.628885
Ohio   -0.258537  0.737132  0.222256
Texas  -0.799923  0.506906  1.511087
Oregon -0.223284  0.009695  0.865808

In [288]:
np.abs(frame)

               b         d         e
Utah    1.447336  1.348350  0.628885
Ohio    0.258537  0.737132  0.222256
Texas   0.799923  0.506906  1.511087
Oregon  0.223284  0.009695  0.865808

*Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame’s apply method does exactly this:*

In [290]:
def f1(x):
    return x.max() + x.min()

In [291]:
frame.apply(f1)

b    0.647413
d    1.358045
e    1.733343
dtype: float64

*Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.*

*If you pass axis="columns" to apply, the function will be invoked once per row instead. A helpful way to think about this is as "apply across the columns":*

In [292]:
frame.apply(f1, axis="columns")

Utah      2.076221
Ohio      0.478594
Texas     0.711164
Oregon    0.642524
dtype: float64

In [293]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [294]:
frame.apply(f2)

            b         d         e
min -0.799923  0.009695  0.222256
max  1.447336  1.348350  1.511087

*Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating-point value in frame. You can do this with applymap:*

In [297]:
def my_format(x):
    return f"{x:.2f}"

In [298]:
frame.applymap(my_format)

            b     d     e
Utah     1.45  1.35  0.63
Ohio    -0.26  0.74  0.22
Texas   -0.80  0.51  1.51
Oregon  -0.22  0.01  0.87

*The reason for the name applymap is that Series has a map method for applying an element-wise function:*

In [299]:
frame["e"].map(my_format)

Utah      0.63
Ohio      0.22
Texas     1.51
Oregon    0.87
Name: e, dtype: object

In [301]:
obj = pd.Series(np.arange(4), index=["d","a","b","c"])

In [302]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [303]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=["three", "one"],columns=["d", "a", "b", "c"])

In [304]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [305]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [306]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [307]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [308]:
obj = pd.Series([4,7,-3,2])

In [309]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [311]:
obj = pd.Series([4, np.nan, 7, np.nan, -3,2])

In [312]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [313]:
obj.sort_values(na_position = "first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [22]:
frame = pd.DataFrame({"b": [4,7,-3,2], "a": [0,1,0,1]})

In [23]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [24]:
frame.sort_values(["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [25]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [26]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [27]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [28]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [29]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],"c": [-2, 5, 8, -2.5]})

In [30]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [31]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [32]:
obj = pd.Series(np.arange(5), index=["a","a","b","b","c"])

In [33]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [34]:
obj.index.is_unique

False

In [35]:
obj["a"]

a    0
a    1
dtype: int64

In [36]:
obj["c"]

4

In [37]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),index=["a", "a", "b", "b", "c"])

In [38]:
df

          0         1         2
a -2.068204 -1.671905 -1.263741
a -2.270918  1.096721  1.545824
b -0.384811  1.263212 -0.543111
b  0.954068 -0.751566 -1.097998
c -1.047313 -0.399591  0.302456

In [39]:
df.loc["b"]

          0         1         2
b -0.384811  1.263212 -0.543111
b  0.954068 -0.751566 -1.097998

In [40]:
df.loc["c"]

0   -1.047313
1   -0.399591
2    0.302456
Name: c, dtype: float64

In [41]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=["a", "b", "c", "d"],columns=["one", "two"])

In [42]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [43]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [44]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [45]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [46]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [47]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [48]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [49]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [50]:
obj = pd.Series(["a","a","b","c"]*4)

In [51]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

*pickle stuff does not work so it was not included*

In [52]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [55]:
uniques = obj.unique()

In [56]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [57]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [58]:
pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [59]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [60]:
mask = obj.isin(["b","c"])

In [61]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [62]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [63]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [64]:
unique_vals = pd.Series(["c","b","a"])

In [66]:
indicies = pd.Index(unique_vals).get_indexer(to_match)

In [67]:
indicies

array([0, 2, 1, 1, 0, 2])

In [68]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],"Qu2": [2, 3, 1, 2, 3],"Qu3": [1, 5, 2, 4, 4]})

In [69]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [70]:
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [71]:
result = data.apply(pd.value_counts).fillna(0)

In [72]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [73]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [74]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [75]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
dtype: int64